فروع علوم الحاسوب
	الذكاء الاصطناعي
		تعلم الآلة
			التعلم الخاضع للإشراف
			التعلم العميق
		معالجة اللغة الطبيعية
			التوليد النصي
			فهم النصوص وتحليلها
		الرؤية الحاسوبية
			التعرف على الصور
			تتبع الكائنات
	هندسة البرمجيات
		التصميم والمعمارية
			أنماط التصميم
			معمارية الخدمات المصغرة
		تطوير الأنظمة
			تطوير الواجهات الأمامية
			تطوير الخوادم والقواعد
		جودة البرمجيات
			الاختبارات الأوتوماتيكية
			مراجعة الكود
	أمن المعلومات
		الأمن السيبراني
			اختبار الاختراق
			الحماية الجدارية
		التشفير
			التشفير المتماثل
			التشفير المفتاحي
	علوم البيانات
		تحليل البيانات
		التنقيب في البيانات
		قواعد البيانات الضخمة
