أقسام العلوم
	العلوم الطبيعية
		الفيزياء
			الفيزياء النظرية
			الفيزياء التجريبية
			علم الفلك والكونيات
		الكيمياء
			الكيمياء العضوية
			الكيمياء الحيوية
			الكيمياء الفيزيائية
		علوم الأرض والبيئة
			الجيولوجيا
			علم الأرصاد الجوية
	العلوم الحياتية
		علم الأحياء
			علم الخلية والوراثة
			الأحياء الدقيقة
			علم البيئة
		العلوم الطبية
			الطب البشري
			الصيدلة والعقاقير
			العلوم العصبية
	العلوم التطبيقية
		الهندسة
			الهندسة الكهربائية
			الهندسة الميكانيكية
			الهندسة المدنية
		التكنولوجيا والمعلومات
			النظم المدمجة
			الاتصالات والشبكات
